---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInAnotherDesignOptionWarn
source: html/5de3d890-e1f8-a518-ee70-76a0ff0d776d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInAnotherDesignOptionWarn Property

An insert in a Design Option cannot be hosted by an element in another Design Option [--if you continue it will not be added to the design option set].

## Syntax (C#)
```csharp
public static FailureDefinitionId ConfusingHostByElementsInAnotherDesignOptionWarn { get; }
```